OpenFOAM-5.x/tutorials/multiphase/vfDependentViscosityFoam/NonNewtonianCouetteFlow/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
	( 0  0  0 )    // vertex number 0
    ( 1  0  0 )    // vertex number 1
    ( 1  1  0 )    // vertex number 2
    ( 0  1  0 )    // vertex number 3
    ( 0  0  1 )    // vertex number 4
    ( 1  0  1 )    // vertex number 5
    ( 1  1  1 )    // vertex number 6
    ( 0  1  1 )    // vertex number 7 
);

blocks
(
    hex (0 1 2 3 4 5 6 7)    	 // vertices
 		(32 32 32)               // numbers of cells in each direction
        simpleGrading (1 1 1)    // cell expansion ratios 
);

boundary
(
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces           ((0 4 7 3));
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces           ((1 5 6 2));
    }
	front
	{
		type 			cyclic;
		neighbourPatch  back;
		faces			((0 1 5 4));
	}
	back
	{
		type 			cyclic;
		neighbourPatch  front;
		faces			
		(
			(3 7 6 2)
		);
	}
	
    topWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    } 

	bottomWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    } 
);

mergePatchPairs
(
);

// ************************************************************************* //
