OpenFOAM-5.x/tutorials/multiphase/vfDependentViscosityFoam/NonNewtonianCouetteFlow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1024;
        startFace       95232;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1024;
        startFace       96256;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1024;
        startFace       97280;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1024;
        startFace       98304;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1024;
        startFace       99328;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1024;
        startFace       100352;
    }
)

// ************************************************************************* //
