OpenFOAM-5.x/tutorials/multiphase/vfDependentViscosityFoam/NonNewtonianCouetteFlow/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  1.6                                   |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Dab           Dab [0 2 -1 0 0 0 0] 0.91e-08;
alphatab           alphatab [0 0 0 0 0 0 0] 1.2;
phases (RBC plasma);
RBC
{
    rho            rho [ 1 -3 0 0 0 0 0 ] 1102;
}
plasma
{
    rho             rho [1 -3 0 0 0 0 0] 1025;
}
transportModel	QuemadaC;
nu              nu [0 2 -1 0 0 0 0] 3.3e-06;
NewtonianCCoeffs
{
	mu			mu [1 -1 -1 0 0 0 0] 3.5e-3;
}
WalburnSchneckCCoeffs
{
    C1	            C1 [ 1 -1 -1 0 0 0 0 ] 0.797e-03;
    TPMA	    	TPMA [ 0 0 0 0 0 0 0 ] 25;
    muMax           muMax [ 1 -1 -1 0 0 0 0 ] 39.05e-03;
    muMin           muMin [ 1 -1 -1 0 0 0 0 ] 3.024e-03;
}
QuemadaCCoeffs
{
    mup             mup [ 1 -1 -1 0 0 0 0 ] 1.32e-03;
    muMax           muMax [ 1 -1 -1 0 0 0 0 ] 66.26e-03;
}
CassonCCoeffs
{
    mup             mup [ 1 -1 -1 0 0 0 0 ] 1.32e-03;
    nuMax           nuMax [ 0 2 -1 0 0 0 0 ] 15.406e-06;
    A               A [ 0 0 0 0 0 0 0 ] 1.387133;
    B               B [ 0.5 -0.5 -1 0 0 0 0 ] 1.965353e-01;
}
// ************************************************************************* //
