OpenFOAM-5.x/tutorials/multiphase/vfDependentViscosityFoam/NonNewtonianCouetteFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.3.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       volVectorField;
	location    "0";
	object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 1 -1 0 0 0 0];
internalField nonuniform List<vector> 32768
(
(0.015625 0.0 0.0)
(0.015625 0.0 0.0)
(0.015625 0.0 0.0)
(0.015625 0.0 0.0)
(0.015625 0.0 0.0)
(0.015625 0.0 0.0)
(0.015625 0.0 0.0)
(0.015625 0.0 0.0)
(0.015625 0.0 0.0)
...
);
boundaryField
{
	topWall
	{
		type fixedValue;
		value uniform (1.0 0.0 0.0);
	}
	right
	{
		type cyclic;
	}
	back
	{
		type cyclic;
	}
	bottomWall
	{
		type fixedValue;
		value uniform (0 0 0);
	}
	front
	{
		type cyclic;
	}
	left
	{
		type cyclic;
	}
}
