OpenFOAM-5.x/tutorials/multiphase/vfDependentViscosityFoam/NonNewtonianCouetteFlow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p_rgh
    {
        solver          GAMG;
        tolerance       5e-03;
        relTol          0;
        smoother        DICGaussSeidel;
		nPreSweeps	0;
        nFinestSweeps   3;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rghFinal
    {
        solver          GAMG;
        tolerance       1e-04;
        relTol          0;
        smoother        DICGaussSeidel;
        nFinestSweeps   3;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-04;
        relTol          0;
    }

    UFinal
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       5e-05;
        relTol          0;
    }

    "(alpha.*)"
    {
		nAlphaCorr		1;
		nAlphaSubCycles	1;

        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0;
        nSweeps         1;
    }
	
	"(alpha.*)Final"
    {
        nAlphaCorr		1;
		nAlphaSubCycles	1;

        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0;
        nSweeps         1;
    }	

}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors 1;
    nCorrectors     4;
    nNonOrthogonalCorrectors 1;
    //pRefCell        0;
    pRefValue       0;
    pRefPoint           (0 0 0);

    residualControl
    {
        U
        {
            tolerance 1e-04;
            relTol 0;
        }

        p_rgh
        {
            tolerance 1e-03;
            relTol 0;
        }

        "alpha.*"
        {
            tolerance 1e-05;
            relTol 0;
        }
        
    }

}

relaxationFactors
{
    fields
    {
	"p_rgh*"      1;
	"alpha.*"      0.9;
    }
    equations
    {
        "U*"           1;
    }
}


// ************************************************************************* //
